Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File            : main.c
  * Brief           : PlusCart(+) Firmware
  * Author          : Wolfgang Stubig <w.stubig@firmaplus.de>
  * Website         : https://gitlab.com/firmaplus/atari-2600-pluscart
  ******************************************************************************
  * (c) 2019 Wolfgang Stubig (Al_Nafuur)
  * based on: UnoCart2600 by Robin Edwards (ElectroTrains)
  *           https://github.com/robinhedwards/UnoCart-2600
  *           and
  *           UnoCart2600 fork by Christian Speckner (DirtyHairy)
  *           https://github.com/DirtyHairy/UnoCart-2600
  ******************************************************************************
  * This program is free software: you can redistribute it and/or modify
  * it under the terms of the GNU General Public License as published by
  * the Free Software Foundation, either version 3 of the License, or
  * (at your option) any later version.
  *
  * This program is distributed in the hope that it will be useful,
  * but WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program.  If not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include <string.h>

#include "global.h"
#include "font.h"
#if USE_WIFI
#include "esp8266.h"
#endif
#if USE_SD_CARD
#include "fatfs.h"
#endif

#include "stm32_udid.h"
#include "flash.h"
#include "cartridge_io.h"
#include "cartridge_firmware.h"
#include "cartridge_emulation_ar.h"
#include "cartridge_detection.h"
#include "cartridge_emulation.h"
#include "cartridge_emulation_df.h"
#include "cartridge_emulation_bf.h"
#include "cartridge_emulation_sb.h"
#include "cartridge_emulation_dpcp.h"

void generate_udid_string(void);

void truncate_curPath(/*uint8_t count*/);

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef struct {
	enum cart_base_type base_type;
	bool withSuperChip;
	bool withPlusFunctions;
	bool uses_ccmram;
	bool uses_systick;
	uint32_t flash_part_address;
} CART_TYPE;

typedef struct {
	const char *ext;
	CART_TYPE cart_type;
} EXT_TO_CART_TYPE_MAP;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

const EXT_TO_CART_TYPE_MAP ext_to_cart_type_map[]__attribute__((section(".flash01"))) = {
	{"ROM",  { base_type_None,    false, false, false, false }},
	{"BIN",  { base_type_None,    false, false, false, false }},
	{"A26",  { base_type_None,    false, false, false, false }},
	{"2K",   { base_type_2K,      false, false, false, false }},
	{"4K",   { base_type_4K,      false, false, false, false }},
	{"4KS",  { base_type_4K,      true,  false, false, false }},
	{"F8",   { base_type_F8,      false, false, false, false }},
	{"F6",   { base_type_F6,      false, false, false, false }},
	{"F4",   { base_type_F4,      false, false, false, false }},
	{"F8S",  { base_type_F8,      true,  false, false, false }},
	{"F6S",  { base_type_F6,      true,  false, false, false }},
	{"F4S",  { base_type_F4,      true,  false, false, false }},
	{"FE",   { base_type_FE,      false, false, false, false }},
	{"3F",   { base_type_3F,      false, false, false, false }},
	{"3E",   { base_type_3E,      false, false, false, false }},
	{"E0",   { base_type_E0,      false, false, false, false }},
	{"084",  { base_type_0840,    false, false, false, false }},
	{"CV",   { base_type_CV,      false, false, false, false }},
	{"EF",   { base_type_EF,      false, false, false, false }},
	{"EFS",  { base_type_EF,      true,  false, false, false }},
	{"F0",   { base_type_F0,      false, false, false, false }},
	{"FA",   { base_type_FA,      false, false, false, false }},
	{"E7",   { base_type_E7,      false, false, false, false }},
	{"DPC",  { base_type_DPC,     false, false, true,  true  }},
	{"AR",   { base_type_AR,      false, false, false, false }},
	{"BF",   { base_type_BF,      false, false, true,  false }},
	{"BFS",  { base_type_BFSC,    false, false, true,  false }},
	{"ACE",  { base_type_ACE,     false, false, false, false }},
	{"WD",   { base_type_PP,      false, false, false, false }},
	{"DF",   { base_type_DF,      false, false, true,  false }},
	{"DFS",  { base_type_DFSC,    false, false, true,  false }},
	{"3EP",  { base_type_3EPlus,  false, false, false, false }},
	{"DPCP", { base_type_DPCplus, false, false, false, true  }},
	{"SB",   { base_type_SB,      false, false, true,  false }},
	{"UA",   { base_type_UA,      false, false, false, false }},

	{0,{0,0,0}}
};

const char *status_message[]__attribute__((section(".flash01#"))) = {

#if MENU_TYPE == UNOCART
	"UnoCart 2600",
#else
	"PlusCart(+)",
#endif
	"Select WiFi Network",
	"No WiFi",
	"WiFi connected",
	"Request timeout",
	"Enter WiFi Password",
	"Enter email or username",
	"Your Chat Message",
	"Offline ROMs erased",
	"ROM file too big!",
	"ACE is not supported",
	"Unknown/invalid ROM",
	"Done",
	"Failed",
	"Firmware download failed",
	"Offline ROMs detected",
	"No offline ROMs detected",
	"DPC+ is not supported",
	"Emulation exited",
	"ROM Download Failed",

	"Setup",
	"Select TV Mode",
	"Select Font",
	"Select Line Spacing",
	"Setup/System Info",
	MENU_TEXT_SEARCH_FOR_ROM,
	"Enter search details",
	"Search results",

//	MENU_TEXT_APPEARANCE,
};

const uint8_t numMenuItemsPerPage[] = {
		// ref: SPACING enum
		14,									// dense
		12,									// medium
		10									// sparse
};

//
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if USE_SD_CARD
SPI_HandleTypeDef hspi2;
#endif
#if USE_WIFI
UART_HandleTypeDef huart1;
#endif

/* USER CODE BEGIN PV */
int num_menu_entries = 0;
char http_request_header[512] __attribute__ ((section (".noinit")));

char stm32_udid[25];


uint8_t buffer[BUFFER_SIZE * 1024] __attribute__((section(".buffer")));
unsigned int cart_size_bytes;

USER_SETTINGS user_settings;

