Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	sprintf(input_field, "Flash Used         %d KiB", (user_settings.first_free_flash_sector - 4 ) * 128);
	make_menu_entry(&dst, input_field, Leave_Menu);

#if USE_SD_CARD
    FATFS FatFs; 	//Fatfs handle
    //Open the file system
    if (f_mount(&FatFs, "", 1) == FR_OK) {
        //Let's get some statistics from the SD card
        DWORD free_clusters, used_size, total_size;
        FATFS* getFreeFs;
        if (f_getfree("", &free_clusters, &getFreeFs) == FR_OK) {
            //Formula comes from ChaN's documentation
            total_size = (getFreeFs->n_fatent - 2) * getFreeFs->csize;
            used_size = total_size - (free_clusters * getFreeFs->csize);

        	sprintf(input_field, "SD-Card Size       %d MiB", (int)(total_size / 2048));
        	make_menu_entry(&dst, input_field, Leave_Menu);
        	sprintf(input_field, "SD-Card Used       %d MiB", (int)(used_size / 2048));
        	make_menu_entry(&dst, input_field, Leave_Menu);
        }
		f_mount(0, "", 1);
    }
#endif

	*input_field = 0;
	return dst;
}

enum e_status_message generateKeyboard(
		MENU_ENTRY **dst,
		MENU_ENTRY *d,
		enum e_status_message menuStatusMessage,
		enum e_status_message new_status) {

	// Scan for any keyboard rows, and if found then generate menu for row
	for (const char ***kb = keyboards; *kb; kb++)
		for (const char **row = *kb; *row; row++)
			if (!strcmp(*row, d->entryname)) {
				make_keyboardFromLine(dst, d->entryname);
				truncate_curPath();
				return menuStatusMessage;
			}

	// look for change of keyboard
	if (!strcmp(d->entryname, MENU_TEXT_LOWERCASE))
		lastKb = KEYBOARD_LOWERCASE;
	else if (!strcmp(d->entryname, MENU_TEXT_UPPERCASE))
		lastKb = KEYBOARD_UPPERCASE;
	else if (!strcmp(d->entryname, MENU_TEXT_SYMBOLS))
		lastKb = KEYBOARD_SYMBOLS;
	else {

		// initial case - use previous keyboard
		menuStatusMessage = new_status;
		strcat(curPath, "/");				// trimmed off, below
	}

	make_keyboard(dst, lastKb);
	truncate_curPath();
	return menuStatusMessage;
}

int entry_compare(const void* p1, const void* p2){
	MENU_ENTRY* e1 = (MENU_ENTRY*)p1;
	MENU_ENTRY* e2 = (MENU_ENTRY*)p2;
	if (e1->type == Leave_Menu) return -1;
	else if (e2->type == Leave_Menu) return 1;
	else if (e1->type == SD_Sub_Menu && e2->type != SD_Sub_Menu) return -1;
	else if (e1->type != SD_Sub_Menu && e2->type == SD_Sub_Menu) return 1;
	else return strcasecmp(e1->entryname, e2->entryname);
}

enum e_status_message buildMenuFromPath( MENU_ENTRY *d )  {
	bool loadStore = false; // ToDo rename to loadPath (could be SD, flash or WiFi path)
	num_menu_entries = 0;
	enum e_status_message menuStatusMessage = STATUS_NONE;

	char *menuFontNames[] = {
			// same ordering as font IDs
			MENU_TEXT_FONT_TJZ,
			MENU_TEXT_FONT_TRICHOTOMIC12,
			MENU_TEXT_FONT_CAPTAIN_MORGAN_SPICE,
			MENU_TEXT_FONT_GLACIER_BELLE
	};

	char *tvModes[] = {
			0,
			MENU_TEXT_TV_MODE_NTSC,		// -->1
			MENU_TEXT_TV_MODE_PAL,		// -->2
			MENU_TEXT_TV_MODE_PAL60,	// -->3
	};

	char *spacingModes[] = {
			MENU_TEXT_SPACING_DENSE,		// referenced by SPACING enum
			MENU_TEXT_SPACING_MEDIUM,
			MENU_TEXT_SPACING_SPARSE,
	};


	MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];
		// and this caters for the trailing slash in the setup string (if present)
//	char *mtsap = mts + sizeof(MENU_TEXT_APPEARANCE);

	if (d->type == Input_Field || d->type == Keyboard_Char || d->type == Keyboard_Row ||
			d->type == Delete_Keyboard_Char || d->type == Leave_SubKeyboard_Menu ){
		// toDo  Input_Field to Leave_SubKeyboard_Menu consecutive!
		int new_status = 1;
		if (strstr(curPath, MENU_TEXT_SEARCH_FOR_ROM) == curPath){
		    new_status = STATUS_SEARCH_DETAILS;
		}else{  // All Setup menu stuff here!
			char *mts = curPath + sizeof(MENU_TEXT_SETUP);   // does a +1 because of MENU_TEXT_SETUP trailing 0
		    if(strstr(mts, MENU_TEXT_PLUS_CONNECT) == mts)
		        new_status = plus_connect;
		    else if(strstr(mts, MENU_TEXT_WIFI_SETUP) == mts)
		        new_status = insert_password;
		    else
		        new_status = STATUS_YOUR_MESSAGE;
		}
		if (d->type == Input_Field)
			*input_field = 0;

		menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, new_status);
	}
	else if(strstr(curPath, MENU_TEXT_SETUP) == curPath) {
		char *mts = curPath + sizeof(MENU_TEXT_SETUP);   // does a +1 because of MENU_TEXT_SETUP trailing 0

		if (!strcmp(curPath, MENU_TEXT_SETUP)){
			menuStatusMessage = STATUS_SETUP;
			dst = generateSetupMenu(dst);
			loadStore = true;
		}

//		else if (strstr(mts, MENU_TEXT_APPEARANCE) == mts) {
//			dst = generateAppearanceMenu(dst);
//			loadStore = true;
//		}

		else if (strstr(mts, URLENCODE_MENU_TEXT_SYSTEM_INFO) == mts) {
			menuStatusMessage = STATUS_SETUP_SYSTEM_INFO;
			dst = generateSystemInfo(dst);
			loadStore = true;

		}



#if USE_WIFI
		// WiFi Setup
		else if (strstr(mts, MENU_TEXT_WIFI_SETUP) == mts) {

			int i = sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_WIFI_SETUP) - 1;

			if ( strlen(curPath) <= i ){

				set_menu_status_msg(curPath);

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_WIFI_SELECT, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_WIFI_WPS_CONNECT, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_WIFI_MANAGER, Menu_Action);
				make_menu_entry(&dst, MENU_TEXT_ESP8266_RESTORE, Menu_Action);
				if(compVersions(esp8266_at_version, CURRENT_ESP8266_FIRMWARE) == -1)
					make_menu_entry(&dst, MENU_TEXT_ESP8266_UPDATE, Menu_Action);

			}

			else {

				mts += sizeof(MENU_TEXT_WIFI_SETUP);

				if (strstr(mts, MENU_TEXT_WIFI_SELECT) == mts) {

					i += (int) sizeof(MENU_TEXT_WIFI_SELECT);
					if (strlen(curPath) > i){

						if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
							// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" + MENU_TEXT_WIFI_SELECT + "/" SSID[33] + Password + "/Enter" + '\0'
							//curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path
							truncate_curPath();

							// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
					        while( curPath[i] != 30 && i < ( SIZEOF_WIFI_SELECT_BASE_PATH + 31) ){
					            i++;
					        }
					        curPath[i] = 0;

					    	if(esp8266_wifi_connect( &curPath[SIZEOF_WIFI_SELECT_BASE_PATH  ],
					    			&curPath[SIZEOF_WIFI_SELECT_BASE_PATH + 32])){
					        	menuStatusMessage = wifi_connected;
					    	}else{
					        	menuStatusMessage = wifi_not_connected;
					    	}
							curPath[0] = '\0';
						}
					}

					else {
						menuStatusMessage = select_wifi_network;
						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
						if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
				    		return esp_timeout;
				    	}
					}

