Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
				}
				else if (strstr(mts, MENU_TEXT_WIFI_WPS_CONNECT) == mts) {

			    	menuStatusMessage = esp8266_wps_connect() ? wifi_connected : wifi_not_connected;
					*curPath = 0;
					HAL_Delay(2000);
				}

				else if (strstr(mts, MENU_TEXT_WIFI_MANAGER) == mts) {

					menuStatusMessage = done;
					esp8266_AT_WiFiManager();
			    	*curPath = 0;
				}

				else if (strstr(mts, MENU_TEXT_ESP8266_RESTORE) == mts) {

					menuStatusMessage = esp8266_reset(true) ? done : failed;
					*curPath = 0;
				}
				else if (strstr(mts, MENU_TEXT_ESP8266_UPDATE) == mts) {
					esp8266_update();
					truncate_curPath();
					menuStatusMessage = buildMenuFromPath(d);
				}
			}
		}
#endif
		// Display

		else if (strstr(mts, MENU_TEXT_DISPLAY) == mts) {


			int i = sizeof(MENU_TEXT_SETUP) + sizeof(MENU_TEXT_DISPLAY) - 1;
			if (strlen(curPath) <= i) {

				set_menu_status_msg(curPath);

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				make_menu_entry(&dst, MENU_TEXT_TV_MODE_SETUP, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_FONT_SETUP, Setup_Menu);
				make_menu_entry(&dst, MENU_TEXT_SPACING_SETUP, Setup_Menu);
			}

			else {

				mts += sizeof(MENU_TEXT_DISPLAY);
				if (strstr(mts, MENU_TEXT_TV_MODE_SETUP) == mts) {

					if(d->type == Menu_Action){

						uint8_t tvMode = TV_MODE_NTSC;
						while (!strstr(tvModes[tvMode], d->entryname + 1))
							tvMode++;

						set_tv_mode(tvMode);

						if(user_settings.tv_mode != tvMode){
							user_settings.tv_mode = tvMode;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else {

						menuStatusMessage = STATUS_SETUP_TV_MODE;
						set_menu_status_msg(curPath);

						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (int tv = 1; tv < sizeof tvModes / sizeof *tvModes; tv++) {
							make_menu_entry(&dst, tvModes[tv], Menu_Action);
							if (user_settings.tv_mode == tv)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}

				}

				else if (strstr(mts, MENU_TEXT_FONT_SETUP) == mts) {

					if(d->type == Menu_Action){

						uint8_t fontStyle = 0;
						while (!strstr(menuFontNames[fontStyle], d->entryname + 1))
							fontStyle++;

						if(user_settings.font_style != fontStyle){
							user_settings.font_style = fontStyle;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else{

						menuStatusMessage = STATUS_SETUP_FONT_STYLE;
						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (uint8_t font=0; font < sizeof menuFontNames / sizeof *menuFontNames; font++) {
							make_menu_entry_font(&dst, menuFontNames[font], Menu_Action, font);
							if (user_settings.font_style == font)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}

				}

				// Text line spacing
				else if (strstr(mts, MENU_TEXT_SPACING_SETUP) == mts) {

					if(d->type == Menu_Action) {

						uint8_t lineSpacing = 0;
						while (!strstr(spacingModes[lineSpacing], d->entryname + 1))
							lineSpacing++;

						if(user_settings.line_spacing != lineSpacing) {
							user_settings.line_spacing = lineSpacing;
							flash_set_eeprom_user_settings(user_settings);
						}

						truncate_curPath();
						menuStatusMessage = buildMenuFromPath(d);
					}

					else {

						menuStatusMessage = STATUS_SETUP_LINE_SPACING;

						make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

						for (uint8_t spacing = 0; spacing < sizeof spacingModes / sizeof *spacingModes; spacing++) {
							make_menu_entry(&dst, spacingModes[spacing], Menu_Action);
							if (user_settings.line_spacing == spacing)
								*(dst-1)->entryname = CHAR_SELECTION;
						}
					}
				}
			}
		}

		else if (strstr(mts, MENU_TEXT_OFFLINE_ROM_UPDATE) == mts) {
#if USE_WIFI
			if( flash_download("&r=1", d->filesize , 0 , false ) != DOWNLOAD_AREA_START_ADDRESS)
				menuStatusMessage = download_failed;
			else {
				menuStatusMessage = done;
	        	*curPath = 0;
			}
#endif
#if USE_SD_CARD
			menuStatusMessage = done;
			*curPath = 0;
#endif
		}

		else if (strstr(mts, MENU_TEXT_DELETE_OFFLINE_ROMS) == mts) {

			flash_erase_storage((uint8_t)FLASH_SECTOR_5);
			user_settings.first_free_flash_sector = (uint8_t) FLASH_SECTOR_5;
		    flash_set_eeprom_user_settings(user_settings);
		    menuStatusMessage = offline_roms_deleted;
        	*curPath = 0;
		}

		else if (strstr(mts, MENU_TEXT_DETECT_OFFLINE_ROMS) == mts) {

			uint32_t last_address = flash_check_offline_roms_size();
			if(last_address > DOWNLOAD_AREA_START_ADDRESS + 1024){
			    user_settings.first_free_flash_sector = (uint8_t) (((last_address - ADDR_FLASH_SECTOR_5) / 0x20000 ) + 6);
			    flash_set_eeprom_user_settings(user_settings);
			    menuStatusMessage = offline_roms_detected;
			}

			else
				menuStatusMessage = no_offline_roms_detected;

    		num_menu_entries = 0;
        	*curPath = 0;
		}
		else{
			// unknown entry must be from PlusStore API, so load from store.
			loadStore = true;
		}
	}

	else if (d->type == Menu_Action){

		if (strstr(curPath, MENU_TEXT_FIRMWARE_UPDATE) == curPath) {
#if USE_WIFI
			strcpy(curPath, "&u=1");
			uint32_t bytes_read = esp8266_PlusStore_API_file_request( buffer, curPath, 0, 0x4000 );
			bytes_read += esp8266_PlusStore_API_file_request( &buffer[0x4000], curPath, 0x8000, (d->filesize - 0x8000) );
#else
			uint32_t bytes_read = 0;
#endif

			if(bytes_read == d->filesize - 0x4000 ){
				__disable_irq();
				HAL_FLASH_Unlock();
				flash_firmware_update(d->filesize);
			}else{
				menuStatusMessage = download_failed;
			}
			*curPath = 0;
		}
		else if (strstr(curPath, MENU_TEXT_SD_FIRMWARE_UPDATE) == curPath) {
#if USE_SD_CARD
			uint32_t bytes_read = sd_card_file_request( buffer, MENU_TEXT_SD_CARD_CONTENT"/firmware.bin", 0, 0x4000 );
			bytes_read += sd_card_file_request( &buffer[0x4000], MENU_TEXT_SD_CARD_CONTENT"/firmware.bin", 0x8000, (d->filesize - 0x8000) );
#else
			uint32_t bytes_read = 0;
#endif

