Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	if (cart_type.base_type != base_type_None)
		cart_size_bytes = d->filesize;

	return cart_type;
}




/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(CART_TYPE cart_type, MENU_ENTRY *d)
{
	int offset = 0;


#if USE_WIFI
	if (cart_type.withPlusFunctions == true ){
 		// Read path and hostname in ROM File from where NMI points to till '\0' and
		// copy to http_request_header
		offset = esp8266_PlusROM_API_connect(cart_size_bytes);
	}
#endif


	if (cart_type.base_type == base_type_2K) {
		memcpy(buffer+0x800, buffer, 0x800);
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x2000, 0x0000, cart_type.withSuperChip);
	}

	else if (cart_type.base_type ==  base_type_4K)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x2000, 0x0000, cart_type.withSuperChip);

	else if (cart_type.base_type == base_type_F8)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF8, 0x1FF9, cart_type.withSuperChip);

	else if (cart_type.base_type == base_type_F6)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF6, 0x1FF9, cart_type.withSuperChip);

	else if (cart_type.base_type == base_type_F4)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FF4, 0x1FFB, cart_type.withSuperChip );

	else if (cart_type.base_type == base_type_FE)
		emulate_FE_cartridge();

	else if (cart_type.base_type == base_type_UA)
		emulate_UA_cartridge();

	else if (cart_type.base_type == base_type_3F)
		emulate_3F_cartridge();

	else if (cart_type.base_type == base_type_3E)
		emulate_3E_cartridge(offset, cart_type.withPlusFunctions);

	else if (cart_type.base_type == base_type_E0)
		emulate_E0_cartridge();

	else if (cart_type.base_type == base_type_0840)
		emulate_0840_cartridge();

	else if (cart_type.base_type == base_type_CV)
		emulate_CV_cartridge();

	else if (cart_type.base_type == base_type_EF)
		emulate_standard_cartridge(offset, cart_type.withPlusFunctions, 0x1FE0, 0x1FEF, cart_type.withSuperChip);

	else if (cart_type.base_type == base_type_F0)
		emulate_F0_cartridge();

	else if (cart_type.base_type == base_type_FA)
		emulate_FA_cartridge(offset, cart_type.withPlusFunctions);

	else if (cart_type.base_type == base_type_E7)
		emulate_E7_cartridge();

	else if (cart_type.base_type == base_type_DPC)
		emulate_DPC_cartridge((uint32_t)cart_size_bytes);

	else if (cart_type.base_type == base_type_AR)
		emulate_ar_cartridge(curPath, cart_size_bytes, buffer, user_settings.tv_mode);

	else if (cart_type.base_type == base_type_PP)
		emulate_pp_cartridge( buffer + 8*1024);

	else if (cart_type.base_type == base_type_DF)
		emulate_df_cartridge(curPath, cart_size_bytes, buffer, d);

	else if (cart_type.base_type == base_type_DFSC)
		emulate_dfsc_cartridge(curPath, cart_size_bytes, buffer, d);

	else if (cart_type.base_type == base_type_BF)
		emulate_bf_cartridge(curPath, cart_size_bytes, buffer, d);

	else if (cart_type.base_type == base_type_BFSC)
		emulate_bfsc_cartridge(curPath, cart_size_bytes, buffer, d);

	else if (cart_type.base_type == base_type_3EPlus)
		emulate_3EPlus_cartridge(offset, cart_type.withPlusFunctions);

	else if (cart_type.base_type == base_type_DPCplus)
		emulate_DPCplus_cartridge(cart_size_bytes);

	else if (cart_type.base_type == base_type_SB)
		emulate_SB_cartridge(curPath, cart_size_bytes, buffer, d);

#if USE_WIFI
	if (cart_type.withPlusFunctions)
		esp8266_PlusStore_API_end_transmission();
#endif

}

void truncate_curPath(){

	for (int selector = 0; keyboards[selector]; selector++)
		for (const char **kbRow = keyboards[selector]; *kbRow; kbRow++) {
			char *kb = strstr(curPath, *kbRow);
			if (kb) {
				*(kb-1) = 0;
				return;
			}
		}

	// trim to last / OR if none, whole path
	char *sep = strrchr(curPath, PATH_SEPERATOR);
	if (!sep)
		sep = curPath;
	*sep = 0;

}

void system_secondary_init(void){
	if(flash_has_downloaded_roms() ){
	    MENU_ENTRY *d = &menu_entries[0];
	    MENU_ENTRY *dst = (MENU_ENTRY *)&menu_entries[0];
		curPath[0] = '\0';
		flash_file_list( curPath, &dst, &num_menu_entries);

		if(strncmp(AUTOSTART_FILENAME_PREFIX, d->entryname, sizeof(AUTOSTART_FILENAME_PREFIX) - 1) == 0 ){
    		CART_TYPE cart_type = identify_cartridge(d);
            HAL_Delay(200);
            if (cart_type.base_type != base_type_None){
                emulate_cartridge(cart_type, d);
            }
		}
		num_menu_entries = 0;
	}
	//	check user_settings properties that haven't been in user_setting since v1
	if( user_settings.line_spacing >= SPACING_MAX )
		user_settings.line_spacing = SPACING_DEFAULT;

	if( user_settings.font_style >= FONT_MAX )
		user_settings.font_style = FONT_DEFAULT;

	set_menu_status_byte(STATUS_StatusByteReboot, 0);
	generate_udid_string();

#if USE_SD_CARD
	// put SD-Card init here
	MX_SPI2_Init();
	MX_FATFS_Init();
#if ! USE_WIFI
	HAL_Delay(500); //a short delay is important to let the SD card settle
#endif
#endif

#if USE_WIFI
	MX_USART1_UART_Init();
	esp8266_init();
	read_esp8266_at_version();
#endif
	// set up status area
}

void append_entry_to_path(MENU_ENTRY *d){

	if(d->type == Cart_File || d->type == Sub_Menu	)
		for (char *p = d->entryname; *p; p++)
			sprintf(curPath + strlen(curPath), strchr(" =+&#%", *p) ? "%%%02X" : "%c", *p);
	else
		strcat(curPath, d->entryname);
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

	uint8_t act_page = 0;
    MENU_ENTRY *d = &menu_entries[0];

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */

